import random

while True:
    man = input("Введіть цифру від 1 до 4, що відповідає: 1 - камінь, 2 - ножиці, 3 - папір, 4 - кінець гри: ")
    if man.isdigit() == True:
        man = int(man)
        if man != 1 and man != 2 and man != 3 and man != 4: man = int(input("Ви помилились, введіть цифру від 1 до 4: "))
        game = random.randint(1, 3)
        if man == game: print("Нічия")
        if game == 1 and man == 2: print("Комп'ютер - камінь, Ви - ножиці\nКомп'ютер виграв, бо камінь ламає ножиці")
        if game == 1 and man == 3: print("Комп'ютер - камінь, Ви - папір\nКомп'ютер виграв, бо папір обгортає камінь")
        if game == 2 and man == 3: print("Комп'ютер - ножиці, Ви - папір\nКомп'ютер виграв, бо ножиці ріжуть папір")
        if game == 2 and man == 1: print("Комп'ютер - ножиці, Ви - камінь\nВи виграли, бо камінь ламає ножиці")
        if game == 3 and man == 1: print("Комп'ютер - папір, Ви - камінь\nКомп'ютер виграв, бо папір обгортає камінь")
        if game == 3 and man == 2: print("Комп'ютер - папір, Ви - ножиці\nВи виграли, бо ножиці ріжуть папір")
        if man == 4:
            print ("Кінець гри")
            break
    else: man = int(input("Ви помилились, введіть цифру від 1 до 4: "))